Repository: Samurai016/concrete_websocket
Catalog: languages/*/LC_MESSAGES/messages.po
Languages: it_it

source: Add WebSocket support.
it_it: Aggiunge il supporto per le WebSocket.

source: This package requires at least version 7 of PHP
it_it: Questo pacchetto richiede almeno la versione 7 di PHP

source: You are not authorized to access this resource.
it_it: Non sei autorizzato ad accedere a questa risorsa.

source: Process not found.
it_it: Processo non trovato.

source: Unable to start process, it is already started.
it_it: Impossibile avviare, il processo è già in esecuzione.

source: Unable to stop process, it is already stopped.
it_it: Impossibile fermare il processo, è già stato fermato.

source: Not logged
it_it: Non loggato

source: PHP executable path not set.
it_it: Percorso dell'eseguibile PHP non impostato.

source: No function available to execute commands
it_it: Nessun metodo disponibile per eseguire i comandi

source: Class %s does not exists.
it_it: La classe %s non esiste.

source: Error while starting process, pid not readable
it_it: Errore durante l'avvio del processo, pid non disponibile.

source: exec, shell_exec and similar functions are disabled, this prevents WebSocket servers from starting. Contact your server administrator and ask him to change this setting. Concrete WebSocket is safe and open-source, we use exec (or similar) only and exclusively to start, shut-down and control WebSocket servers. Edit your php.ini file (placed at %s) to enable it, see the FAQs on GitHub to see how to do it.
it_it: exec, shell_exec e le funzioni equivalenti sono disabilitate, questo impedisce di avviare i server WebSocket. Contatta il tuo amministratore del server e chiedigli di modificare questa impostazione. Concrete WebSocket è sicuro e open-source, utilizziamo exec (o equivalenti) solo ed esclusivamente per avviare, spegnere e controllare i server WebSocket. Modifica il file php.ini (posizione: %s) per abilitarlo, consulta le FAQ su GitHub per vedere come fare.

source: unknown path
it_it: percorso sconosciuto

source: A new version of Concrete WebSocket (<b>%s</b>) is available, <a href="%s" target="_blank">please update it here</a>.
it_it: È disponibile una nuova versione di Concrete WebSocket (<b>%s</b>), <a href="%s" target="_blank">perfavore, aggiornala qui</a>.

source: Invalid token. Please refresh the page and try again.
it_it: Token di sicurezza non valido. Perfavore, ricarica la pagina e riprova.

source: The port must be a number between %s and %s.
it_it: La porta deve essere un numero tra %s e %s.

source: Settings saved
it_it: Impostazioni salvate

source: You must specify a REST API password.
it_it: Devi inserire una password per la REST API.

source: You must specify a valid PHP executable path.
it_it: Devi inserire un percorso valido dell'eseguibile PHP.

source: GitHub Page
it_it: Pagina GitHub

source: Available processes
it_it: Processi disponibili

source: Name
it_it: Nome

source: Status
it_it: Stato

source: Port
it_it: Porta

source: Turned off
it_it: Spento

source: Running
it_it: In esecuzione

source: Start process
it_it: Avvia processo

source: Start
it_it: Avvia

source: Stop process
it_it: Ferma processo

source: Stop
it_it: Ferma

source: Restart process
it_it: Riavvia processo

source: Restart
it_it: Riavvia

source: No process available
it_it: Nessun processo disponibile

source: Settings
it_it: Impostazioni

source: REST API Password
it_it: Password REST API

source: For security, Concrete WebSocket requests a password for the REST API so malicious users can't start/stop servers without be authorized.<br/>Any calls to Concrete WebSocket API <b>MUST</b> have the <code>%s</code> query param or the header <code>%s</code> set.
it_it: Per motivi di sicurezza, Concrete WebSocket richiede una password per l'API REST in modo che gli utenti malintenzionati non possano avviare/arrestare i server senza essere autorizzati.<br/>Qualsiasi chiamata all'API di Concrete Websocket DEVE AVERE il query param <code>%s</code> o l'header <code>%s</code> impostato.

source: PHP Executable Path
it_it: Percorso eseguibile PHP

source: To start the servers, Concrete WebSocket needs to know the PHP executable path.<br/><b>By default you should find the correct path already set</b> here but if you notice errors in starting the servers or you are on Windows systems, make sure that the path set here is correct.
it_it: Per avviare i server, Concrete WebSocket ha bisogno di conoscere il percorso eseguibile di PHP.<br/><b>Per impostazione predefinita dovresti trovare il percorso corretto già impostato qui sopra</b> ma se noti errori nell'avvio dei server o se ti trovi su sistemi Windows, assicurati che il percorso qui impostato sia corretto.

source: Save settings
it_it: Salva impostazioni
